{
  "_class_name": "AutoencoderKL_Skip",
  "_diffusers_version": "0.26.3",
  "act_fn": "silu",
  "block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "down_block_types": [
    "DownEncoderSkipBlock2D",
    "DownEncoderSkipBlock2D",
    "DownEncoderSkipBlock2D",
    "DownEncoderSkipBlock2D"
  ],
  "force_upcast": false,
  "in_channels": 3,
  "latent_channels": 4,
  "layers_per_block": 2,
  "norm_num_groups": 32,
  "out_channels": 3,
  "sample_size": 512,
  "scaling_factor": 0.18215,
  "up_block_types": [
    "UpDecoderSkipBlock2D",
    "UpDecoderSkipBlock2D",
    "UpDecoderSkipBlock2D",
    "UpDecoderSkipBlock2D"
  ],
  "use_skip": true,
  "training": false
}
